Repository: FrozenBirdXD/LivTu
Catalog: lib/l10n/app_*.arb
Languages: de

source: Profile
de: Profil

# loginLoadingDialog
source: Logging you in securely. This may take a moment.
de: Wir loggen dich sicher ein. Dies kann einen Moment dauern.

# ohNoError
source: Oh no, an error has occurred!
de: Ups, ein Fehler ist aufgetreten!

source: Password Reset Email Sent
de: Zurücksetzungs-E-Mail versendet

# passwordResetInstructions
source: An email has been sent to your email address. Follow the directions in the email to reset your password.
de: Eine E-Mail wurde an deine Adresse gesendet. Befolge die Anweisungen in der E-Mail, um dein Passwort zurückzusetzen.

source: Sign out
de: Abmelden

# signOutConformation
source: Are you sure you want to sign out?
de: Bist du dir sicher, dass du dich abmelden möchtest?

source: Cancel
de: Abbrechen

source: Overview
de: Übersicht

source: Password
de: Passwort

source: Change Password
de: Passwort ändern

# enterNewPasswordPrompt
source: Enter a new password to update your current one.
de: Gib ein neues Passwort ein, um dein aktuelles Passwort zu ändern.

source: Password cannot be empty
de: Passwort kann nicht leer sein

source: New Password
de: Neues Passwort

source: Update Password
de: Passwort ändern

# passwordUpdateSuccessful
source: Password updated successfully!
de: Passwort erfolgreich geändert!

# weakPasswordAuthExceptionPrompt
source: Weak password - Please enter a stronger password.
de: Schwaches Passwort - Bitte gib ein stärkeres Passwort ein.

# requiresRecentLoginAuthExceptionPrompt
source: This operation requires you to have logged in recently. Please log in and try again.
de: Für diese Aktion musst du dich kürzlich angemeldet haben. Bitte logge dich ein und versuche es erneut.

# couldNotUpdatePasswordExceptionPrompt
source: Could not update password, please try again.
de: Passwort konnte nicht geändert werden. Bitte versuche es erneut.

source: Change Username
de: Benuternamen ändern

# enterNewUsernamePrompt
source: Enter a new Username to update your current one.
de: Gib ein neuen Benuternamen ein, um dein aktuellen zu ändern.

source: Username cannot be empty
de: Benutername kann nicht leer sein

source: New Username
de: Neuer Benutername

source: Update Username
de: Benuternamen ändern

# usernameUpdatedSuccessful
source: Username updated successfully!
de: Benuternamen erfolgreich geändert!

# couldNotUpdateUsernameExceptionPrompt
source: Could not update username, please try again.
de: Benutername konnte nicht geändert werden. Bitte versuche es erneut.

source: Profile Options
de: Profil Optionen

source: Edit Event
de: Termin bearbeiten

source: Save
de: speichern

source: Description
de: Beschreibung

source: Title cannot be empty
de: Titel kann nicht leer sein

source: title
de: Titel

source: TO
de: BIS

source: FROM
de: VON

source: Schedule
de: Termine

source: My Schedule
de: Meine Termine

source: Day
de: Tag

source: Week
de: Woche

source: Month
de: Monat

source: Settings
de: Einstellungen

source: Language
de: Sprache

source: Study Material
de: Lernmaterial

source: Tutors
de: Tutoren

source: My Tutor
de: Mein Tutor

source: Not registered
de: Nicht registriert

# invalidEmailAuthExceptionPrompt
source: Invalid email - Please enter a valid email address.
de: Ungültige E-Mail - Bitte gib eine gültige E-Mail-Adresse ein.

# userNotFoundAuthExceptionPrompt
source: User not found - Please check if the email is correct or register a new account.
de: Benutzer nicht gefunden - Bitte überprüfe, ob die E-Mail korrekt ist oder registriere ein neues Konto.

# notProcessedTryAgainPrompt
source: We could not process your request. Please try again in a moment.
de: Wir konnten deine Anfrage nicht verarbeiten. Bitte versuche es in einem Moment erneut.

source: Forgot Password?
de: Passwort vergessen

source: Forgot Password? Don't worry!
de: Passwort vergessen? Keine Sorge!

# forgotPasswordInstructions
source: Simply enter your email address and follow the directions in the email.
de: Gib einfach deine E-Mail-Adresse ein und folge den Anweisungen in der E-Mail.

source: Send password reset link
de: Sende Zurücksetzungslink

# goBackToLogin
source: Go back to login page
de: Zurück zur Login Seite

# emailAlreadyInUseAuthExceptionPrompt
source: Email address already in use - Please sign in.
de: E-Mail-Adresse bereits in Verwendung - Bitte melde dich an.

# authenticationError
source: Authentication error - Please try again.
de: Authentifizierungsfehler - Bitte versuche es erneut.

source: Join Us!
de: Werde Mitglied!

# signUpPrompt
source: Sign up now to access all features in LivTu. It only takes a minute!
de: Registriere dich jetzt, um alle Funktionen in LivTu nutzen zu können. Es dauert nur ne Minute!

source: Sign up
de: Registrieren

# alreadyRegisteredGoToLogin
source: Already registered? Login here!
de: Schon registriert? Hier anmelden!

source: Log In
de: Anmelden

# wrongPasswordAuthExceptionPrompt
source: Incorrect credentials - Please try again.
de: Falsche Anmeldeinformationen - Bitte versuche es erneut.

source: Welcome back!
de: Willkommen zurück!

# logInToLivTuPrompt
source: Please log in to your acount to access your LivTu Profile!
de: Bitte melde dich mit deinem Konto an, um auf dein LivTu-Profil zuzugreifen!

# notRegisteredGoToSignUp
source: Not registered yet? Sign up here!
de: Kein Konto? Registriere dich hier!

# verifyYourEmail
source: Verify your email address
de: Verifiziere deine Email Adresse

# verificationEmailInstructions
source: We've sent you a verification email. Please open it to verify your account.
de: Wir haben dir eine Bestätigungs-E-Mail gesendet. Bitte öffne diese, um dein Konto zu verifizieren.

# gotNoVerificationEmail
source: If you haven't received a verification yet, press the button below:
de: Wenn du noch keine Bestätigungs-E-Mail erhalten hast, klicke bitte auf den folgenden Button:

source: Resend verification email
de: Bestätigungs-E-Mail erneut senden

source: Purchases
de: Käufe

source: Become Tutor
de: Werde Tutor

# inAMomentReadyPrompt
source: In a moment, we'll be ready.
de: In einem Moment sind wir bereit.
